[
  "The Constitution establishes the fundamental principles of government and law.",
  "Constitutional rights protect individual freedoms and liberties.",
  "The Constitution defines the structure and powers of government branches.",
  "Constitutional amendments provide mechanisms for legal and governmental change.",
  "Due process ensures fair treatment under the law as guaranteed by the Constitution.",
  "Equal protection under the law is a fundamental constitutional principle.",
  "Criminal law deals with crimes and their punishments, involving prosecution by the state.",
  "Civil law handles disputes between private parties, including contracts and torts.",
  "Contract law governs legally binding agreements between parties.",
  "Family law covers marriage, divorce, child custody, and domestic relations.",
  "Employment law regulates the relationship between employers and employees.",
  "Real estate law governs property transactions, ownership, and land use.",
  "Immigration law controls entry, residence, and naturalization in a country.",
  "Business law encompasses regulations affecting commercial activities and corporations.",
  "Personal injury law allows individuals to seek compensation for harm caused by others.",
  "Estate planning involves wills, trusts, and distribution of assets after death.",
  "Intellectual property law protects creations of the mind like patents and copyrights.",
  "Administrative law governs the actions of government agencies and regulatory bodies.",
  "Small claims court handles minor disputes with simplified procedures and lower costs.",
  "Mediation and arbitration are alternative dispute resolution methods outside of court.",
  "Legal aid provides free or low-cost legal services to those who cannot afford attorneys.",
  "Miranda rights must be read to suspects in police custody before interrogation.",
  "Due process rights protect individuals from arbitrary government actions.",
  "The statute of limitations sets time limits for filing legal claims.",
  "Burden of proof determines who must prove facts in a legal case.",
  "Attorney-client privilege protects confidential communications with lawyers.",
  "Probable cause is required for police searches and arrests.",
  "Plea bargaining allows defendants to negotiate reduced charges or sentences.",
  "Habeas corpus protects against unlawful detention by the government.",
  "Eminent domain allows government to take private property for public use with compensation.",
  "Negligence occurs when someone fails to exercise reasonable care causing harm to others."
]